# GetFailureDefinitionId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..GetFailureDefinitionId Method
FailureMessage Class See Also
---
Retrieves the id of the failure definition for the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureDefinitionId GetFailureDefinitionId()
```

Visual Basic
---
```text
Public Function GetFailureDefinitionId As FailureDefinitionId
```

Visual C++
---
```text
public:
FailureDefinitionId^ GetFailureDefinitionId()
```

# ### Return Value
The id of the FailureDefinition for the failure.
# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace